<a href="https://colab.research.google.com/github/wnich/datarockie_datasci_bootcamp_06/blob/main/R/Flight_2013/Flights_r.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# install packages and libraries

install.packages(c("tidyverse",
                     "dplyr",
                     "readr", "readxl"))
install.packages("nycflights13")

library(nycflights13)
library(dplyr)

Installing packages into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)


Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

flights: *On-time data for all flights that departed NYC (i.e. JFK, LGA or EWR) in 2013.*


*   flight is index


*   arr_delay/dep_delay  : Departure and arrival delays, in minutes. Negative times represent early departures/arrivals.






airlines: Look up airline names from their carrier codes.

In [13]:
# load data
data("flights", "airlines", "airports")

# glimpse data
glimpse(flights)
glimpse(airlines)
glimpse(airports)

Rows: 336,776
Columns: 19
$ year           <int> 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2…
$ month          <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ day            <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ dep_time       <int> 517, 533, 542, 544, 554, 554, 555, 557, 557, 558, 558, …
$ sched_dep_time <int> 515, 529, 540, 545, 600, 558, 600, 600, 600, 600, 600, …
$ dep_delay      <dbl> 2, 4, 2, -1, -6, -4, -5, -3, -3, -2, -2, -2, -2, -2, -1…
$ arr_time       <int> 830, 850, 923, 1004, 812, 740, 913, 709, 838, 753, 849,…
$ sched_arr_time <int> 819, 830, 850, 1022, 837, 728, 854, 723, 846, 745, 851,…
$ arr_delay      <dbl> 11, 20, 33, -18, -25, 12, 19, -14, -8, 8, -2, -3, 7, -1…
$ carrier        <chr> "UA", "UA", "AA", "B6", "DL", "UA", "B6", "EV", "B6", "…
$ flight         <int> 1545, 1714, 1141, 725, 461, 1696, 507, 5708, 79, 301, 4…
$ tailnum        <chr> "N14228", "N24211", "N619AA", "N804JB", "N668DN", "N394…
$ origin         <chr> "EWR", "LGA", "JFK", "JFK", "LGA", "EWR", "EWR", "LGA",…
$ dest           <chr> "IAH", "IAH", "MIA", "BQN", "ATL", "ORD", "FLL", "IAD",…
$ air_time       <dbl> 227, 227, 160, 183, 116, 150, 158, 53, 140, 138, 149, 1…
$ distance       <dbl> 1400, 1416, 1089, 1576, 762, 719, 1065, 229, 944, 733, …
$ hour           <dbl> 5, 5, 5, 5, 6, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 6, 6, 6…
$ minute         <dbl> 15, 29, 40, 45, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0…
$ time_hour      <dttm> 2013-01-01 05:00:00, 2013-01-01 05:00:00, 2013-01-01 0…
Rows: 16
Columns: 2
$ carrier <chr> "9E", "AA", "AS", "B6", "DL", "EV", "F9", "FL", "HA", "MQ", "O…
$ name    <chr> "Endeavor Air Inc.", "American Airlines Inc.", "Alaska Airline…
Rows: 1,458
Columns: 8
$ faa   <chr> "04G", "06A", "06C", "06N", "09J", "0A9", "0G6", "0G7", "0P2", "…
$ name  <chr> "Lansdowne Airport", "Moton Field Municipal Airport", "Schaumbur…
$ lat   <dbl> 41.13047, 32.46057, 41.98934, 41.43191, 31.07447, 36.37122, 41.4…
$ lon   <dbl> -80.61958, -85.68003, -88.10124, -74.39156, -81.42778, -82.17342…
$ alt   <dbl> 1044, 264, 801, 523, 11, 1593, 730, 492, 1000, 108, 409, 875, 10…
$ tz    <dbl> -5, -6, -6, -5, -5, -5, -5, -5, -5, -8, -5, -6, -5, -5, -5, -5, …
$ dst   <chr> "A", "A", "A", "A", "A", "A", "A", "A", "U", "A", "A", "U", "A",…
$ tzone <chr> "America/New_York", "America/Chicago", "America/Chicago", "Ameri…

In [3]:
## rename carrier col in airlines
airlines <- airlines %>%
          rename("ABBV" = carrier )

**When was the busiest travel period (month) in New York?**

Total flights departed from NY in 2013:

In [4]:
flights %>% summarise(n())

  n()
1 336776

In [5]:
flights %>%
    group_by(month) %>%
    summarise(total_flights = n()) %>%
    arrange(desc(total_flights)) %>%
    head(3)

  month total_flights
1  7    29425
2  8    29327
3 10    28889



---



---

**When was the least busiest travel period (month) in 2013?**

In [6]:
flights %>%
    group_by(month) %>%
    summarise(count_flight = n()) %>%
    arrange(desc(count_flight)) %>%
    tail(1)

  month count_flight
1 2     24951



---
---

**What were the 3 most popular destinations where New Yorkers visited in 2013?**

In [7]:
flights %>%
    group_by(dest) %>% 
    summarize(number_flights = n()) %>% 
    arrange(desc(number_flights)) %>% 
    left_join(airports ,by = c("dest" = "faa")) %>%
    select(1,3,2)%>%
    head(3) 

#pop_dest <- pop_dest[,c(1,3,2)]
#pop_dest

  dest name                            number_flights
1 ORD  Chicago Ohare Intl              17283
2 ATL  Hartsfield Jackson Atlanta Intl 17215
3 LAX  Los Angeles Intl                16174

In [8]:
flights %>%
    filter(dest == "LAX") %>%
    count(dest)

  dest n
1 LAX  16174



---



---

**Top 10 airlines had the most flights to NY in 2013**

In [46]:
flights %>% #.......call
  count(carrier) %>%     #.......# of carriers operated in that month
  arrange(desc(n)) %>%   #.......ordering/sorting
  left_join(airlines, by = "carrier" ) %>%  # to get fullnames of airlines
  head(10)

   carrier n     name
1  UA      58665 United Air Lines Inc.
2  B6      54635 JetBlue Airways
3  EV      54173 ExpressJet Airlines Inc.
4  DL      48110 Delta Air Lines Inc.
5  AA      32729 American Airlines Inc.
6  MQ      26397 Envoy Air
7  US      20536 US Airways Inc.
8  9E      18460 Endeavor Air Inc.
9  WN      12275 Southwest Airlines Co.
10 VX       5162 Virgin America



---



---

**The five most on-time departure airlines at JFK**

In [31]:
flights %>%
  group_by(carrier)%>%
  summarize(avg_dep_delay = mean(dep_delay, na.rm = T)) %>%
  arrange(avg_dep_delay) %>%
  left_join(airlines,by = "carrier") %>%
  head(5)

  carrier avg_dep_delay name
1 US      3.782418      US Airways Inc.
2 HA      4.900585      Hawaiian Airlines Inc.
3 AS      5.804775      Alaska Airlines Inc.
4 AA      8.586016      American Airlines Inc.
5 DL      9.264505      Delta Air Lines Inc.

**The most least on time airlines at JFK**

In [32]:
jfk_time <- flights %>%
    group_by(carrier)%>%
    filter(origin == "JFK") %>%
    summarize(avg_delay = mean(arr_delay, na.rm = T)) %>%
    arrange(desc(avg_delay)) %>% 
    left_join(airlines,by = "carrier") %>%
    head(3)

In [33]:
jfk_time

  carrier avg_delay name
1 EV      17.788839 ExpressJet Airlines Inc.
2 MQ      12.468704 Envoy Air
3 B6       8.893702 JetBlue Airways